{
    "attachments": [],
    "resource_id": 29934,
    "current_version_id": 60039,
    "download_count": 0,
    "resource_version_id": 64879,
    "version_string": "0.20",
    "last_update": 1740041168,
    "rating_avg": 4.56522,
    "rating_count": 0,
    "rating_sum": 0,
    "resource_category_id": 7,
    "resource_date": 1708690907,
    "review_count": 26,
    "tag_line": "A continuation of Luuks Tyre Thermals and Wear Mod",
    "update_count": 8,
    "path": "MXFQY32S5\/60039\/",
    "filename": "tyre-thermals-and-wear.zip",
    "title": "Tyre Wear and Thermals Redux",
    "user_id": 393895,
    "username": "Zesty_Maple98",
    "tagid": "MXFQY32S5",
    "message": "A continuation of the lovely mod by Luuk. It completely reworks thermal and wear characteristics and resultant grip using some simulation and real world data. It also adds brake cooling ducts which are saved to vehicle configurations, tyre popping at very low condition, heat transfer across the surface of the tyre and probably a few more things.\n[HR][\/HR]\n\n\nGameplay showcase for v0.19, being purposefully hard on the front tyres\n[MEDIA=youtube]z43a1_UgsYw[\/MEDIA]\n\n\nNew tyre popping! (The full clip is a bit over a minute) from v0.15\n[MEDIA=vimeo]915152516[\/MEDIA]\n\n\nThese two pics below show the difference in heat build up from weight transfer and camber from 0.16\n[IMG]https:\/\/i.imgur.com\/7z4XHHQ.png[\/IMG]\n[IMG]https:\/\/i.imgur.com\/sWyK75o.png[\/IMG]\n\nUI (above):\nThe pairs of red triangles on each wheel display where the peak of the load on the tyre is. Note this isn't exactly the same as wheel camber, as the tyre deforms, but should be used as a rough guide as to where most of the heat will be generated on the tyre.\n\n\nShowcase video for v0.17 from BriNgeR & айфилгуд (ifeelkayf) from BeamNG Motorsports discord\n[MEDIA=youtube]FZBqAEAm0gg[\/MEDIA]\n\n\n[HR][\/HR]\nSee below for the original mod description from Luuk\n[URL]https:\/\/www.beamng.com\/resources\/luuks-tyre-thermals-and-wear-mod.26947\/[\/URL]\n[HR][\/HR]\n\nDiscussion thread:\n[URL]https:\/\/www.beamng.com\/threads\/tyre-wear-and-thermals-mod-discussion.97035\/[\/URL]\n\nMod features:\n- Multiplayer compatible;\n- Tyre thermals based on several factors (tyre slip, load & camber, brake temperature);\n- Tyre wear based on similar factors, and the tyre thermals;\n- 4 temperature zones (inner, center, outer and core);\n- Brake cooling sliders in tuning settings for all vehicles;\n- Dynamic tyre grip based on thermals and wear;\n- User settings for brake duct cooling, preheating tyres etc. so you can drive how you want to (it's a sandbox game after all)\n\nPlanned features:\n- Various user settings, for preheating tyres and other customization so you can use the mod how you want to (it's a sandbox game after all)\n- Support for various compounds (standards, sports and race tyres);\n- Existing tuning settings like tyre pressure will have an intuitive and meaningful impact on tyre temps and wear\n- Rebalanced condition degradation and heating to make sense for non-track driving\n\nKnown issues:\n- The UI can sometimes misposition tyres when the vehicle has more than 4 wheels\n\nThe future of the mod:\nWhile this mod is currently focused around racing and hotlapping (as that's my favourite part of the game), I understand that it's not the only thing to do in BeamNG. This means that once I'm generally satisfied with how the mod feels on the track, I'll focus on areas like rallying, off-road and city driving.\n\nContributors:\n- Cyborella: A huge source of inspiration, sim-data and advice for increasing realism\n- ⭐[USER=53119]@lucky4luuk[\/USER]: The original mod author\n- [USER=531843]@Redknee[\/USER]: Helped get Luuk and running with the UI, providing concept art and valuable feedback!\n\nDevelopment Update Oct 5th 2024:\nThose who have been following development will have noticed that the mod hasn't been updated in a while. This is because a new thermals and wear mod is in the works, written from scratch, but I've unfortunately ran into many issues due to lack to domain knowledge surrounding tyre behavior and this new mod falls short in similar ways to the current version.\n\nI have read as much as I can around the topic (scientific papers, articles, forums etc.) but there is too little publicly accessible educational material to give the mod the accuracy I want for it.\n\nMy degree-level mechanical engineering experience has only taken development so far. If any engineers are interested in contributing and have knowledge or resources in automotive tyre mechanics, I invite you to reach out so we can discuss it.\n\nChangelog:\nv0.19: Wear is now slightly increased when driving outside of ideal temperatures. This means that some thought needs to go in when deciding to push the car to trade slightly more grip for moderately higher wear\nv0.18.2: Tyres will no longer overlap on the UI. However, some wheels will appear in the incorrect position. A more complex but reliable system is in the works\nv0.18.1: Tyres will no longer be dead after about 80% condition due to new wear vs grip curve taken from real data. They will be usable for much longer\nv0.18:\n- Brake cooling sliders for every vehicle, found within the vehicles tuning settings to influence how hot\/cold the brakes get and, as a result, how hot\/cold the tyres get. These are also saved in the .pc vehicle configuration file so the settings are saved in configs and can be shared with others.\n- Thermals rework with big help from Cyborella!\n- Increased wear rate again\n\nv0.17: Extreme temps made more brutal for grip, wear rate lowered significantly, lateral Gs now generate temperature better\nv0.16: Thermals rework, tyre heat should be much more dynamic. Significantly increased accuracy of camber detection\nv0.15: Rebalanced heat accumulation and street tyre's grip due to temp. also only race tyres start preheated\nv0.14: New versioning system, tyre popping and thermals rework due to tyre slipping. Heat also builds more evenly across a tyre instead of building up in the center ring;\n\nDonations:\nCompletely optional, my mods will always be free, but it does help with motivation\n[URL]https:\/\/ko-fi.com\/amplesamples[\/URL]\n\nSource code:\n[URL]https:\/\/github.com\/ample-samples\/tyre-thermals-and-wear[\/URL]\nFeel free to download the preview version to play on your own machine",
    "category_title": "",
    "prefix_title": "Alpha",
    "via": "packed by repo on Fri, 03 Oct 2025 01:41:05 GMT",
    "hashes": [
        [
            "scripts\/luukstyrethermalsandwear\/modscript.lua",
            "3beac66e1a50f1d7"
        ],
        [
            "license",
            "94480190c088bc67"
        ],
        [
            "lua\/vehicle\/extensions\/auto\/luukstyrethermalsandwear.lua",
            "568e68f02f861ad4"
        ],
        [
            "lua\/vehicle\/extensions\/tyredata.lua",
            "7a00a7f33badc8ad"
        ],
        [
            "lua\/vehicle\/extensions\/tyre_utils.lua",
            "2bb11c382e6a5887"
        ],
        [
            "lua\/common\/extensions\/htmltools.lua",
            "07bf653f4de9cd4e"
        ],
        [
            "lua\/common\/extensions\/thermals_wear_utils.lua",
            "faffde383bf1eadc"
        ],
        [
            "lua\/ge\/extensions\/luukstyrethermalsandwear.lua",
            "46da8c2941dbef1e"
        ],
        [
            "lua\/ge\/extensions\/createbrakeductsliders.lua",
            "02cc67d39097e6a1"
        ],
        [
            "ui\/modules\/apps\/tyrewearthermals\/app.js",
            "f7bcefd9d02ed8c5"
        ],
        [
            "ui\/modules\/apps\/tyrewearthermals\/app.png",
            "29c4b32ad49d5dbf"
        ],
        [
            "ui\/modules\/apps\/tyrewearthermals\/app.json",
            "ef8bb10175cfab39"
        ],
        [
            "readme.md",
            "523e1cb35ae2ac9f"
        ]
    ]
}